# SynchronizeWithCentralOptions Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SynchronizeWithCentralOptions Methods
SynchronizeWithCentralOptions Class See Also
---
The SynchronizeWithCentralOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetRelinquishOptions | Gets the options which govern whether or not to relinquish elements and workset types. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| SetRelinquishOptions | Sets the options which govern whether or not to relinquish elements and workset types. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
SynchronizeWithCentralOptions Class
Autodesk.Revit.DB Namespace